In [1]:
import pandas as pd

#Series(1D Data)
a=pd.Series([10,20,30])

#DataFrame(2D Data)
b=pd.DataFrame({"Name":["Jay","Smith","John","Rachel","Maya"],
                "Age":[24,21,28,22,30],
               "Designation":["Software Developer","Teacher","Data Analyst","ML Engineer","Product Manager"]})
print(a)
print(b)

0    10
1    20
2    30
dtype: int64
     Name  Age         Designation
0     Jay   24  Software Developer
1   Smith   21             Teacher
2    John   28        Data Analyst
3  Rachel   22         ML Engineer
4    Maya   30     Product Manager

In [2]:
b.head(2)

    Name  Age         Designation
0    Jay   24  Software Developer
1  Smith   21             Teacher

In [3]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         5 non-null      object
 1   Age          5 non-null      int64
 2   Designation  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [4]:
b.shape

(5, 3)

In [5]:
b.tail(2)

     Name  Age      Designation
3  Rachel   22      ML Engineer
4    Maya   30  Product Manager

In [6]:
b.describe()

             Age
count   5.000000
mean   25.000000
std     3.872983
min    21.000000
25%    22.000000
50%    24.000000
75%    28.000000
max    30.000000

In [7]:
b["Age"]

0    24
1    21
2    28
3    22
4    30
Name: Age, dtype: int64

In [8]:
b[["Age","Designation"]]

   Age         Designation
0   24  Software Developer
1   21             Teacher
2   28        Data Analyst
3   22         ML Engineer
4   30     Product Manager

In [9]:
b[b["Age"]>25]

   Name  Age      Designation
2  John   28     Data Analyst
4  Maya   30  Product Manager

In [10]:
b.isnull().sum()

Name           0
Age            0
Designation    0
dtype: int64

In [11]:
b["Promotion"]=b["Age"]>25

In [12]:
b

     Name  Age         Designation  Promotion
0     Jay   24  Software Developer      False
1   Smith   21             Teacher      False
2    John   28        Data Analyst       True
3  Rachel   22         ML Engineer      False
4    Maya   30     Product Manager       True

In [13]:
b.sort_values("Age", ascending=False)

     Name  Age         Designation  Promotion
4    Maya   30     Product Manager       True
2    John   28        Data Analyst       True
0     Jay   24  Software Developer      False
3  Rachel   22         ML Engineer      False
1   Smith   21             Teacher      False

In [14]:
b.rename(columns={"Designation": "Role"})

     Name  Age                Role  Promotion
0     Jay   24  Software Developer      False
1   Smith   21             Teacher      False
2    John   28        Data Analyst       True
3  Rachel   22         ML Engineer      False
4    Maya   30     Product Manager       True